const RulesModal = ({
  isOpen,
  onConfirm,
}: {
  isOpen: boolean;
  onConfirm: () => void;
}) => {
  if (!isOpen) return null;

  return (
    <div className="fixed inset-0 z-[50000] flex items-center justify-center bg-black/50 backdrop-blur-sm">
      <div className="font-iranyekan max-h-[90vh] w-[90%] max-w-4xl overflow-hidden rounded-xl bg-white p-6 text-right shadow-lg">
        <h2 className="mb-2 text-xl font-bold text-gray-800">
          شرایط و تعهدات طرفین قرارداد
        </h2>
        <div
          className="h-[60vh] overflow-y-auto pr-2"
          style={{ direction: 'ltr' }}
        >
          <p className="text-sm leading-7 text-gray-700"   style={{ direction: 'rtl' }}>
            استفاده از این سامانه به منزله پذیرش کلیه قوانین و مقررات آن است.
            کاربر موظف است اطلاعات خود را به‌صورت صحیح و کامل وارد نماید و در
            صورت بروز هرگونه مشکل ناشی از اطلاعات نادرست، مسئولیت آن بر عهده
            کاربر خواهد بود.
            <br />
            کاربر متعهد می‌شود از این سامانه در چارچوب قوانین جمهوری اسلامی
            ایران استفاده نماید و هرگونه سوء استفاده، تقلب یا فعالیت خلاف قانون
            موجب مسدودسازی حساب کاربری و پیگرد قانونی خواهد شد.
            <br />
            این سامانه متعهد می‌شود اطلاعات کاربران را نزد خود محفوظ نگه دارد و
            از افشای آن به غیر خودداری نماید، مگر در مواردی که مراجع قانونی
            درخواست کنند.
            <br />
            در صورت بروز هرگونه مشکل فنی یا سیستمی، تیم پشتیبانی در اسرع وقت
            برای رفع آن اقدام خواهد کرد، اما مسئولیتی بابت اختلالات ناشی از
            اینترنت، تجهیزات کاربر یا موارد خارج از کنترل سامانه نخواهد داشت.
            <br />
            ادامه استفاده از سامانه به منزله پذیرش تمامی این شرایط است. استفاده
            از این سامانه به منزله پذیرش کلیه قوانین و مقررات آن است. کاربر موظف
            است اطلاعات خود را به‌صورت صحیح و کامل وارد نماید و در صورت بروز
            هرگونه مشکل ناشی از اطلاعات نادرست، مسئولیت آن بر عهده کاربر خواهد
            بود.
            <br />
            کاربر متعهد می‌شود از این سامانه در چارچوب قوانین جمهوری اسلامی
            ایران استفاده نماید و هرگونه سوء استفاده، تقلب یا فعالیت خلاف قانون
            موجب مسدودسازی حساب کاربری و پیگرد قانونی خواهد شد.
            <br />
            این سامانه متعهد می‌شود اطلاعات کاربران را نزد خود محفوظ نگه دارد و
            از افشای آن به غیر خودداری نماید، مگر در مواردی که مراجع قانونی
            درخواست کنند.
            <br />
            در صورت بروز هرگونه مشکل فنی یا سیستمی، تیم پشتیبانی در اسرع وقت
            برای رفع آن اقدام خواهد کرد، اما مسئولیتی بابت اختلالات ناشی از
            اینترنت، تجهیزات کاربر یا موارد خارج از کنترل سامانه نخواهد داشت.
            <br />
            ادامه استفاده از سامانه به منزله پذیرش تمامی این شرایط است.
          </p>
        </div>

        <button
          className="mt-6 w-full cursor-pointer rounded bg-orange-500 py-3 text-white transition hover:bg-orange-600"
          onClick={onConfirm}
        >
          تایید و ادامه
        </button>
      </div>
    </div>
  );
};

export default RulesModal;
