import { useState } from 'react';
import SearchArticle from '../components/blogSection/SearchArticle';
import MainBlogCards from '../components/blogSection/MainBlogCards';
import LatestArticles from '../components/blogSection/LatestArticles';
import BlogTags from '../components/blogSection/BlogTags';
import SeeAllBlogs from '../components/blogSection/SeeAllBlogs';

export interface BlogType {
  id: string;
  title: string;
  content: string;
  readTime: number;
  readed: number;
  src: string;
}

const blogs: BlogType[] = [
  {
    id: '1',
    title: 'مزایا و معایب اجاره خودرو در ایران',
    content: `امروزه اجاره خودرو در ایران به یک صنعت پول‌ساز و محبوب تبدیل شده است. بسیاری از مردم برای سفرهای کاری، تفریحی یا حتی مراسم‌ خاص مثل عروسی به جای خرید خودرو، آن را اجاره می‌کنند. اما این کار چه مزایا و معایبی دارد؟ ✅ مزایای اجاره خودرو صرفه‌جویی در هزینه‌ها وقتی ماشین اجاره می‌کنی، دیگه پول بیمه، تعمیرات، مالیات و افت قیمت ماشین گردنت نیست. همه این خرج‌های دردسرساز پای شرکت اجاره‌دهنده است. دسترسی به ماشین‌های لوکس واقعیت اینه که خرید یه پورشه یا لکسوس چند میلیارد تومن پول می‌خواد ولی با اجاره می‌تونی چند روز سوارش بشی و از حس رانندگی باهاش لذت ببری. آسودگی در سفرها مثلا وقتی میری کیش، نیازی نیست ماشینت رو با هزار بدبختی ببری اونجا. راحت اجاره می‌کنی و توی جزیره می‌چرخی. ❌ معایب اجاره خودرو هزینه بالا در بلندمدت     اگه خیلی زیاد اجاره کنی، مثلا هر هفته، جمع هزینه‌هاش می‌تونه از قسط یه ماشین صفر بیشتر بشه. محدودیت‌های شرکت‌ها بعضی شرکت‌ها محدودیت کیلومتر دارند، مثلا میگن روزی فقط ۲۰۰ کیلومتر. اگه بیشتر بری، جریمه می‌شی. نیاز به ضمانت و مدارک خاص بیشتر شرکت‌ها پول پیش و چک یا سفته می‌خوان که برای خیلی‌ها دردسره. 💡 جمع‌بندی اجاره خودرو برای سفرهای کوتاه‌مدت، مراسم‌ خاص و کارهای فوری ایده‌آله؛ اما برای استفاده بلندمدت به‌صرفه نیست. قبل از اجاره، همیشه شرایط و قوانین شرکت رو دقیق بخون تا تو دردسر نیفتی.`,
    readTime: 3,
    readed: 1243,
    src: '../../public/images/blogs/1carImage.png',
  },
  {
    id: '2',
    title: 'مزایا و معایب اجاره خودرو در ایران',
    content: `امروزه اجاره خودرو در ایران به یک صنعت پول‌ساز و محبوب تبدیل شده است. بسیاری از مردم برای سفرهای کاری، تفریحی یا حتی مراسم‌ خاص مثل عروسی به جای خرید خودرو، آن را اجاره می‌کنند. اما این کار چه مزایا و معایبی دارد؟ ✅ مزایای اجاره خودرو صرفه‌جویی در هزینه‌ها وقتی ماشین اجاره می‌کنی، دیگه پول بیمه، تعمیرات، مالیات و افت قیمت ماشین گردنت نیست. همه این خرج‌های دردسرساز پای شرکت اجاره‌دهنده است. دسترسی به ماشین‌های لوکس واقعیت اینه که خرید یه پورشه یا لکسوس چند میلیارد تومن پول می‌خواد ولی با اجاره می‌تونی چند روز سوارش بشی و از حس رانندگی باهاش لذت ببری. آسودگی در سفرها مثلا وقتی میری کیش، نیازی نیست ماشینت رو با هزار بدبختی ببری اونجا. راحت اجاره می‌کنی و توی جزیره می‌چرخی. ❌ معایب اجاره خودرو هزینه بالا در بلندمدت     اگه خیلی زیاد اجاره کنی، مثلا هر هفته، جمع هزینه‌هاش می‌تونه از قسط یه ماشین صفر بیشتر بشه. محدودیت‌های شرکت‌ها بعضی شرکت‌ها محدودیت کیلومتر دارند، مثلا میگن روزی فقط ۲۰۰ کیلومتر. اگه بیشتر بری، جریمه می‌شی. نیاز به ضمانت و مدارک خاص بیشتر شرکت‌ها پول پیش و چک یا سفته می‌خوان که برای خیلی‌ها دردسره. 💡 جمع‌بندی اجاره خودرو برای سفرهای کوتاه‌مدت، مراسم‌ خاص و کارهای فوری ایده‌آله؛ اما برای استفاده بلندمدت به‌صرفه نیست. قبل از اجاره، همیشه شرایط و قوانین شرکت رو دقیق بخون تا تو دردسر نیفتی.`,
    readTime: 3,
    readed: 1243,
    src: '../../public/images/blogs/2carImage.png',
  },
  {
    id: '3',
    title: 'مزایا و معایب اجاره خودرو در ایران',
    content: `امروزه اجاره خودرو در ایران به یک صنعت پول‌ساز و محبوب تبدیل شده است. بسیاری از مردم برای سفرهای کاری، تفریحی یا حتی مراسم‌ خاص مثل عروسی به جای خرید خودرو، آن را اجاره می‌کنند. اما این کار چه مزایا و معایبی دارد؟ ✅ مزایای اجاره خودرو صرفه‌جویی در هزینه‌ها وقتی ماشین اجاره می‌کنی، دیگه پول بیمه، تعمیرات، مالیات و افت قیمت ماشین گردنت نیست. همه این خرج‌های دردسرساز پای شرکت اجاره‌دهنده است. دسترسی به ماشین‌های لوکس واقعیت اینه که خرید یه پورشه یا لکسوس چند میلیارد تومن پول می‌خواد ولی با اجاره می‌تونی چند روز سوارش بشی و از حس رانندگی باهاش لذت ببری. آسودگی در سفرها مثلا وقتی میری کیش، نیازی نیست ماشینت رو با هزار بدبختی ببری اونجا. راحت اجاره می‌کنی و توی جزیره می‌چرخی. ❌ معایب اجاره خودرو هزینه بالا در بلندمدت     اگه خیلی زیاد اجاره کنی، مثلا هر هفته، جمع هزینه‌هاش می‌تونه از قسط یه ماشین صفر بیشتر بشه. محدودیت‌های شرکت‌ها بعضی شرکت‌ها محدودیت کیلومتر دارند، مثلا میگن روزی فقط ۲۰۰ کیلومتر. اگه بیشتر بری، جریمه می‌شی. نیاز به ضمانت و مدارک خاص بیشتر شرکت‌ها پول پیش و چک یا سفته می‌خوان که برای خیلی‌ها دردسره. 💡 جمع‌بندی اجاره خودرو برای سفرهای کوتاه‌مدت، مراسم‌ خاص و کارهای فوری ایده‌آله؛ اما برای استفاده بلندمدت به‌صرفه نیست. قبل از اجاره، همیشه شرایط و قوانین شرکت رو دقیق بخون تا تو دردسر نیفتی.`,
    readTime: 3,
    readed: 1243,
    src: '../../public/images/blogs/3carImage.png',
  },
  {
    id: '4',
    title: 'مزایا و معایب اجاره خودرو در ایران',
    content: `امروزه اجاره خودرو در ایران به یک صنعت پول‌ساز و محبوب تبدیل شده است. بسیاری از مردم برای سفرهای کاری، تفریحی یا حتی مراسم‌ خاص مثل عروسی به جای خرید خودرو، آن را اجاره می‌کنند. اما این کار چه مزایا و معایبی دارد؟ ✅ مزایای اجاره خودرو صرفه‌جویی در هزینه‌ها وقتی ماشین اجاره می‌کنی، دیگه پول بیمه، تعمیرات، مالیات و افت قیمت ماشین گردنت نیست. همه این خرج‌های دردسرساز پای شرکت اجاره‌دهنده است. دسترسی به ماشین‌های لوکس واقعیت اینه که خرید یه پورشه یا لکسوس چند میلیارد تومن پول می‌خواد ولی با اجاره می‌تونی چند روز سوارش بشی و از حس رانندگی باهاش لذت ببری. آسودگی در سفرها مثلا وقتی میری کیش، نیازی نیست ماشینت رو با هزار بدبختی ببری اونجا. راحت اجاره می‌کنی و توی جزیره می‌چرخی. ❌ معایب اجاره خودرو هزینه بالا در بلندمدت     اگه خیلی زیاد اجاره کنی، مثلا هر هفته، جمع هزینه‌هاش می‌تونه از قسط یه ماشین صفر بیشتر بشه. محدودیت‌های شرکت‌ها بعضی شرکت‌ها محدودیت کیلومتر دارند، مثلا میگن روزی فقط ۲۰۰ کیلومتر. اگه بیشتر بری، جریمه می‌شی. نیاز به ضمانت و مدارک خاص بیشتر شرکت‌ها پول پیش و چک یا سفته می‌خوان که برای خیلی‌ها دردسره. 💡 جمع‌بندی اجاره خودرو برای سفرهای کوتاه‌مدت، مراسم‌ خاص و کارهای فوری ایده‌آله؛ اما برای استفاده بلندمدت به‌صرفه نیست. قبل از اجاره، همیشه شرایط و قوانین شرکت رو دقیق بخون تا تو دردسر نیفتی.`,
    readTime: 3,
    readed: 1243,
    src: '../../public/images/blogs/4carImage.png',
  },
  {
    id: '5',
    title: 'مزایا و معایب اجاره خودرو در ایران',
    content: `امروزه اجاره خودرو در ایران به یک صنعت پول‌ساز و محبوب تبدیل شده است. بسیاری از مردم برای سفرهای کاری، تفریحی یا حتی مراسم‌ خاص مثل عروسی به جای خرید خودرو، آن را اجاره می‌کنند. اما این کار چه مزایا و معایبی دارد؟ ✅ مزایای اجاره خودرو صرفه‌جویی در هزینه‌ها وقتی ماشین اجاره می‌کنی، دیگه پول بیمه، تعمیرات، مالیات و افت قیمت ماشین گردنت نیست. همه این خرج‌های دردسرساز پای شرکت اجاره‌دهنده است. دسترسی به ماشین‌های لوکس واقعیت اینه که خرید یه پورشه یا لکسوس چند میلیارد تومن پول می‌خواد ولی با اجاره می‌تونی چند روز سوارش بشی و از حس رانندگی باهاش لذت ببری. آسودگی در سفرها مثلا وقتی میری کیش، نیازی نیست ماشینت رو با هزار بدبختی ببری اونجا. راحت اجاره می‌کنی و توی جزیره می‌چرخی. ❌ معایب اجاره خودرو هزینه بالا در بلندمدت     اگه خیلی زیاد اجاره کنی، مثلا هر هفته، جمع هزینه‌هاش می‌تونه از قسط یه ماشین صفر بیشتر بشه. محدودیت‌های شرکت‌ها بعضی شرکت‌ها محدودیت کیلومتر دارند، مثلا میگن روزی فقط ۲۰۰ کیلومتر. اگه بیشتر بری، جریمه می‌شی. نیاز به ضمانت و مدارک خاص بیشتر شرکت‌ها پول پیش و چک یا سفته می‌خوان که برای خیلی‌ها دردسره. 💡 جمع‌بندی اجاره خودرو برای سفرهای کوتاه‌مدت، مراسم‌ خاص و کارهای فوری ایده‌آله؛ اما برای استفاده بلندمدت به‌صرفه نیست. قبل از اجاره، همیشه شرایط و قوانین شرکت رو دقیق بخون تا تو دردسر نیفتی.`,
    readTime: 3,
    readed: 1243,
    src: '../../public/images/blogs/5carImage.png',
  },
  {
    id: '6',
    title: 'مزایا و معایب اجاره خودرو در ایران',
    content: `امروزه اجاره خودرو در ایران به یک صنعت پول‌ساز و محبوب تبدیل شده است. بسیاری از مردم برای سفرهای کاری، تفریحی یا حتی مراسم‌ خاص مثل عروسی به جای خرید خودرو، آن را اجاره می‌کنند. اما این کار چه مزایا و معایبی دارد؟ ✅ مزایای اجاره خودرو صرفه‌جویی در هزینه‌ها وقتی ماشین اجاره می‌کنی، دیگه پول بیمه، تعمیرات، مالیات و افت قیمت ماشین گردنت نیست. همه این خرج‌های دردسرساز پای شرکت اجاره‌دهنده است. دسترسی به ماشین‌های لوکس واقعیت اینه که خرید یه پورشه یا لکسوس چند میلیارد تومن پول می‌خواد ولی با اجاره می‌تونی چند روز سوارش بشی و از حس رانندگی باهاش لذت ببری. آسودگی در سفرها مثلا وقتی میری کیش، نیازی نیست ماشینت رو با هزار بدبختی ببری اونجا. راحت اجاره می‌کنی و توی جزیره می‌چرخی. ❌ معایب اجاره خودرو هزینه بالا در بلندمدت     اگه خیلی زیاد اجاره کنی، مثلا هر هفته، جمع هزینه‌هاش می‌تونه از قسط یه ماشین صفر بیشتر بشه. محدودیت‌های شرکت‌ها بعضی شرکت‌ها محدودیت کیلومتر دارند، مثلا میگن روزی فقط ۲۰۰ کیلومتر. اگه بیشتر بری، جریمه می‌شی. نیاز به ضمانت و مدارک خاص بیشتر شرکت‌ها پول پیش و چک یا سفته می‌خوان که برای خیلی‌ها دردسره. 💡 جمع‌بندی اجاره خودرو برای سفرهای کوتاه‌مدت، مراسم‌ خاص و کارهای فوری ایده‌آله؛ اما برای استفاده بلندمدت به‌صرفه نیست. قبل از اجاره، همیشه شرایط و قوانین شرکت رو دقیق بخون تا تو دردسر نیفتی.`,
    readTime: 3,
    readed: 1243,
    src: '../../public/images/blogs/6carImage.png',
  },
];

const Blog = () => {
  const [filteredSearch, setFilteredSearch] = useState(blogs);
  const [search, setSearch] = useState('');

  const lastArticles = blogs.slice(blogs.length - 5, blogs.length - 1);

  function handleSearch(searchText: string) {
    const filteredContent = blogs.filter((blog) => {
      return (
        blog.title.includes(searchText) || blog.content.includes(searchText)
      );
    });

    setFilteredSearch(filteredContent);
  }

  return (
    <div className="bg-gray-100 px-4 py-10">
      <SearchArticle
        search={search}
        setSearch={setSearch}
        handleSearch={handleSearch}
      />

      <div className="max-w-8xl mx-auto grid grid-cols-1 gap-8 md:grid-cols-4">
        <div className="order-2 grid grid-cols-1 gap-6 md:order-1 md:col-span-3 md:grid-cols-2 lg:grid-cols-3">
          {filteredSearch.map((item) => (
            <MainBlogCards
              content={item.content}
              id={item.id}
              readTime={item.readTime}
              readed={item.readed}
              src={item.src}
              title={item.title}
            />
          ))}
        </div>

        {/* Sidebar - Latest Articles */}
        <div className="order-1 space-y-6 md:order-2 md:col-span-1">
          <div className="rounded-lg bg-white p-4">
            <h2 className="mb-4 inline-block border-b-4 border-yellow-400 text-xl font-bold">
              آخرین مقالات
            </h2>
            <div className="space-y-4">
              {lastArticles.map((item) => (
                <LatestArticles
                  content={item.content}
                  id={item.id}
                  readTime={item.readTime}
                  readed={item.readed}
                  src={item.src}
                  title={item.title}
                />
              ))}
            </div>
          </div>

          {/* Tags */}
          <BlogTags />
        </div>
      </div>

      {/* View All */}
      <SeeAllBlogs />
    </div>
  );
};

export default Blog;
